Autodesk.Revit.DB.AreaTag.AreaTagType
The tag type.

Autodesk.Revit.DB.AreaTag.Area
The area that the tag is associated with.
Remarks: In rare cases, the tag may not be associated to an area.  The property will
be null in these situations.

Autodesk.Revit.DB.AreaTag
Provides access to the area topology in Autodesk Revit.
Remarks: The areaTag object can be queried for its boundary for use in space planning tools.